FROM node:18.12.1
# 1) поставь nodeJs
# корневая программа которая нужна для работы (если образ есть на компьютере возьмем его, если нету пойдем на докерХаб)

WORKDIR /rest-api-server
# 2) создай рабочую папку
# команда для создания раб директории

COPY . .
# 3) скопируй файлы проекта в рабочую папку
# source откуда("." = корневой каталог, так как докер лежит в корне ) dest куда("/app" = корневой каталог)

RUN npm instal
# 4) поставь node_modules
# RUN === выполнить команду в терминале

EXPOSE 3000
# 5) задать порт запуска проекта

CMD [ "node", "server.js" ]
# 6) указать команду запуска проекта

# docker build . ==> сделать образ
# docker images  ==> посмотреть доступные образы
# docker run imageId  ==> создать/запустить контейнер из образа и зайти в консоль контейнера
# docker run -d -p 4000:3000 imageId  ==> создать/запустить контейнер из образа // -d = не заходить в консоль контейнера // определяем порты (vps + local = EXPOSE)
# docker ps  ==> показывает все запущенные контейнеры (запуск в новом терминале)
# docker stop containerId  ==> остановить контейнер (запуск в новом терминале)
# docker start containerId  ==> запустить контейнер 